{"class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [5, 5], "trainable": true, "use_bias": false, "data_format": "channels_first", "kernel_constraint": null, "filters": 64, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "dtype": "float32", "name": "conv2d_7", "dilation_rate": [1, 1], "batch_input_shape": [null, 96, 96, 1], "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.23984498493023781}}, "activation": "relu", "bias_constraint": null, "padding": "same", "strides": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_7", "padding": "valid", "data_format": "channels_last", "trainable": true, "pool_size": [2, 2], "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [5, 5], "trainable": true, "use_bias": false, "data_format": "channels_first", "kernel_constraint": null, "filters": 128, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "activation": "relu", "name": "conv2d_8", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.029980623116279727}}, "bias_constraint": null, "padding": "same", "strides": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_8", "padding": "valid", "data_format": "channels_last", "trainable": true, "pool_size": [2, 2], "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [5, 5], "trainable": true, "use_bias": false, "data_format": "channels_first", "kernel_constraint": null, "filters": 256, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "activation": "relu", "name": "conv2d_9", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.021199501909719556}}, "bias_constraint": null, "padding": "same", "strides": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_9", "padding": "valid", "data_format": "channels_last", "trainable": true, "pool_size": [12, 12], "strides": [12, 12]}}, {"class_name": "Flatten", "config": {"name": "flatten_3", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "noise_shape": null, "trainable": true, "rate": 0.5, "seed": null}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "use_bias": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "activation": "relu", "name": "dense_5", "units": 300, "bias_constraint": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.05}}}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "use_bias": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "activation": "softmax", "name": "dense_6", "units": 8, "bias_constraint": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.06923728330662726}}}}], "backend": "tensorflow", "keras_version": "2.1.2"}