{"class_name": "Model", "config": {"input_layers": [["input_2", 0, 0], ["input_3", 0, 0]], "name": "model_2", "output_layers": [["dense_3", 0, 0]], "layers": [{"class_name": "InputLayer", "name": "input_2", "inbound_nodes": [], "config": {"name": "input_2", "batch_input_shape": [null, 15, 65], "dtype": "float32", "sparse": false}}, {"class_name": "LSTM", "name": "lstm_1", "inbound_nodes": [[["input_2", 0, 0, {}]]], "config": {"go_backwards": false, "bias_regularizer": null, "stateful": false, "bias_constraint": null, "unroll": false, "implementation": 1, "recurrent_regularizer": null, "return_sequences": true, "name": "lstm_1", "unit_forget_bias": true, "return_state": false, "use_bias": true, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_dropout": 0.0, "activity_regularizer": null, "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "recurrent_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "dropout": 0.0, "recurrent_activation": "hard_sigmoid", "kernel_regularizer": null, "units": 250, "kernel_constraint": null}}, {"class_name": "InputLayer", "name": "input_3", "inbound_nodes": [], "config": {"name": "input_3", "batch_input_shape": [null, 15, 4040], "dtype": "float32", "sparse": false}}, {"class_name": "Concatenate", "name": "concatenate_1", "inbound_nodes": [[["lstm_1", 0, 0, {}], ["input_3", 0, 0, {}]]], "config": {"name": "concatenate_1", "axis": -1, "trainable": true}}, {"class_name": "LSTM", "name": "lstm_2", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "config": {"go_backwards": false, "bias_regularizer": null, "stateful": false, "bias_constraint": null, "unroll": false, "implementation": 1, "recurrent_regularizer": null, "return_sequences": true, "name": "lstm_2", "unit_forget_bias": true, "return_state": false, "use_bias": true, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_dropout": 0.0, "activity_regularizer": null, "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "recurrent_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "dropout": 0.0, "recurrent_activation": "hard_sigmoid", "kernel_regularizer": null, "units": 250, "kernel_constraint": null}}, {"class_name": "Dense", "name": "dense_3", "inbound_nodes": [[["lstm_2", 0, 0, {}]]], "config": {"activity_regularizer": null, "bias_regularizer": null, "use_bias": true, "trainable": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "name": "dense_3", "kernel_regularizer": null, "units": 65, "activation": "softmax", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null}}]}, "backend": "tensorflow", "keras_version": "2.1.2"}