{"class_name": "Sequential", "keras_version": "2.1.2", "backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"kernel_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "batch_input_shape": [null, 1, 96, 96], "data_format": "channels_first", "trainable": true, "activity_regularizer": null, "dilation_rate": [1, 1], "use_bias": false, "name": "conv2d_7", "filters": 64, "strides": [1, 1], "kernel_size": [5, 5], "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.0752750669425842, "seed": null}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_7", "data_format": "channels_last", "strides": [2, 2], "padding": "valid", "pool_size": [2, 2], "trainable": true}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "bias_constraint": null, "activation": "relu", "padding": "same", "data_format": "channels_first", "trainable": true, "activity_regularizer": null, "dilation_rate": [1, 1], "use_bias": false, "name": "conv2d_8", "filters": 128, "strides": [1, 1], "kernel_size": [5, 5], "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.009409383367823026, "seed": null}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_8", "data_format": "channels_last", "strides": [2, 2], "padding": "valid", "pool_size": [2, 2], "trainable": true}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "bias_constraint": null, "activation": "relu", "padding": "same", "data_format": "channels_first", "trainable": true, "activity_regularizer": null, "dilation_rate": [1, 1], "use_bias": false, "name": "conv2d_9", "filters": 256, "strides": [1, 1], "kernel_size": [5, 5], "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.006653438786171575, "seed": null}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_9", "data_format": "channels_last", "strides": [12, 12], "padding": "valid", "pool_size": [12, 12], "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_3", "trainable": true}}, {"class_name": "Dropout", "config": {"seed": null, "name": "dropout_3", "noise_shape": null, "trainable": true, "rate": 0.5}}, {"class_name": "Dense", "config": {"bias_constraint": null, "activation": "relu", "kernel_regularizer": null, "trainable": true, "activity_regularizer": null, "use_bias": true, "name": "dense_5", "units": 300, "bias_initializer": {"class_name": "Ones", "config": {}}, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "bias_regularizer": null, "kernel_constraint": null}}, {"class_name": "Dense", "config": {"bias_constraint": null, "activation": "softmax", "kernel_regularizer": null, "trainable": true, "activity_regularizer": null, "use_bias": true, "name": "dense_6", "units": 8, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02173004008128404, "seed": null}}, "bias_regularizer": null, "kernel_constraint": null}}]}