{"backend": "tensorflow", "class_name": "Model", "keras_version": "2.2.2", "config": {"output_layers": [["dense_6", 0, 0]], "name": "model_2", "layers": [{"inbound_nodes": [], "name": "input_2", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 4040], "dtype": "float32", "sparse": false, "name": "input_2"}}, {"inbound_nodes": [[["input_2", 0, 0, {}]]], "name": "dense_5", "class_name": "Dense", "config": {"trainable": true, "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "units": 500, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "name": "dense_5", "kernel_regularizer": null, "use_bias": true, "activation": "relu"}}, {"inbound_nodes": [[["dense_5", 0, 0, {}]]], "name": "dense_6", "class_name": "Dense", "config": {"trainable": true, "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "units": 16, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "name": "dense_6", "kernel_regularizer": null, "use_bias": true, "activation": "sigmoid"}}], "input_layers": [["input_2", 0, 0]]}}